Documents/ПоступлениеПлатежа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПоступлениеПлатежа</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьПоОбъектамВнесудебная</xr:Item>
				<xr:Item>AccumulationRegister.ИсторияПлатежей</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьПоСудебнымРешениям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешнийID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Займ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПлательщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлательщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПлатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеразнесеннаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазнесениеПоСудебнымРешениям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьРешения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженностиПоРешению</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазнесениеПоВнесудебке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Займ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗадолженности</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЗадолженности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтадииЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтадииЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СтарыйУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внесудебная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расчетная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судебная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидДвиженияЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидДвиженияЗадолженности</Name>
			<Comment>Трейд Софт</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отозвано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СудебноеРешение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеПлатежа/Ext/ManagerModule.bsl
Процедура ПровестиПоследовательность(ЭтотОбъект) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      |	ПоступлениеПлатежа.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ПоступлениеПлатежа КАК ПоступлениеПлатежа
	                      |ГДЕ
	                      |	ПоступлениеПлатежа.Займ = &Займ
	                      |	И ПоступлениеПлатежа.ДатаПлатежа >= &МоментВремени
	                      |	И ПоступлениеПлатежа.Проведен = ИСТИНА
	                      |	И ПоступлениеПлатежа.Ссылка <> &Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ПоступлениеПлатежа.ДатаПлатежа,
	                      |	Ссылка");
	Запрос.УстановитьПараметр("Займ", ЭтотОбъект.Займ);
	Запрос.УстановитьПараметр("МоментВремени", ЭтотОбъект.ДатаПлатежа);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("МоментВремениДок", ЭтотОбъект.МоментВремени());
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Для Каждого стр Из Результат Цикл
		ДокументОбъект = стр.Ссылка.ПолучитьОбъект();
		
		Для Каждого Движение ИЗ ДокументОбъект.Движения Цикл
			Если Движение.Количество() > 0 Тогда
				Точка = Найти(Строка(Движение), ".");
				ВидРегистра = "РегистрНакопления";
				РегистрИмя = СокрП(Сред(Строка(Движение), Точка + 1));
				НаборЗаписей = РегистрыНакопления[РегистрИмя].СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДокументОбъект.Ссылка);            
			Иначе
				НаборЗаписей = Движение;
			КонецЕсли;
			Попытка
				НаборЗаписей.Записать();
			Исключение
				//Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
		
		ДокументОбъект.Проведен = Ложь;
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		//ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Стадия = ОбъектыСервер.ОпределитьВариантУчетаЗадолженности2(ЭтотОбъект.Займ,ДокументОбъект.ДатаПлатежа);
		Если Стадия = Перечисления.СтадииЗадолженности.Судебная Тогда 
			ДокументОбъект.РаспределитьПоСудебнымРешениям();
			ДокументОбъект.Движения.ЗадолженностьПоСудебнымРешениям.Записывать = Истина;
			Для Каждого ТекСтрокаРазнесениеПоСудебнымРешениям Из ДокументОбъект.РазнесениеПоСудебнымРешениям Цикл
				Движение = ДокументОбъект.Движения.ЗадолженностьПоСудебнымРешениям.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.ВидДвиженияЗадолженности = Перечисления.ВидДвиженияЗадолженности.Оплата;
				Движение.Период = ДокументОбъект.ДатаПлатежа;
				Движение.Займ = ДокументОбъект.Займ;
				Движение.Решение = ТекСтрокаРазнесениеПоСудебнымРешениям.Решение;
				Движение.ЧастьРешения = ТекСтрокаРазнесениеПоСудебнымРешениям.ЧастьРешения;
				Движение.ТипЗадолженности = ТекСтрокаРазнесениеПоСудебнымРешениям.ТипЗадолженности;
				Движение.Сумма = ТекСтрокаРазнесениеПоСудебнымРешениям.Сумма;
			КонецЦикла;	
			ДокументОбъект.Движения.ЗадолженностьПоСудебнымРешениям.Записать();
			ДокументОбъект.Проведен = Истина;
			
		Иначе
			ДокументОбъект.РаспределитьПоВнесудебке();
			ДокументОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Записывать = Истина;
			Если ДокументОбъект.РазнесениеПоВнесудебке.Количество() > 0 Тогда
				Движение = ДокументОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.ВидДвиженияЗадолженности = Перечисления.ВидДвиженияЗадолженности.Оплата;
				Движение.Период = ДокументОбъект.ДатаПлатежа;
				Движение.Объект = ДокументОбъект.Займ;
				
				Для Каждого ТекСтрокаРазнесениеПоВнесудебке Из ДокументОбъект.РазнесениеПоВнесудебке Цикл
					Движение[ТекСтрокаРазнесениеПоВнесудебке.ТипЗадолженности.ИмяПредопределенныхДанных + "ДО"] = Движение[ТекСтрокаРазнесениеПоВнесудебке.ТипЗадолженности.ИмяПредопределенныхДанных + "ДО"] + ТекСтрокаРазнесениеПоВнесудебке.Сумма;	
					Движение[ТекСтрокаРазнесениеПоВнесудебке.ТипЗадолженности.ИмяПредопределенныхДанных + "Регл"] = Движение[ТекСтрокаРазнесениеПоВнесудебке.ТипЗадолженности.ИмяПредопределенныхДанных + "Регл"] + ТекСтрокаРазнесениеПоВнесудебке.Сумма;
				КонецЦикла;
				
			КонецЕсли;  
			
			ДокументОбъект.ПосчитатьОбщуюСуммуПоВнесудебке(Движение, ДокументОбъект.РазнесениеПоВнесудебке);
			
			
			Если ДокументОбъект.НеразнесеннаяСумма > 0 Тогда
				Движение = ДокументОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.ВидДвиженияЗадолженности = Перечисления.ВидДвиженияЗадолженности.Оплата;
				Движение.Период = ДокументОбъект.ДатаПлатежа;	
				Движение.Объект = ДокументОбъект.Займ;
				
				СоставляющаяСписания = РасчетЗадолженностиВнесудебка.СоставляющаяСписанияПриПереплате();
				Движение[СоставляющаяСписания.ИмяПредопределенныхДанных + "ДО"] = ДокументОбъект.НеразнесеннаяСумма;
				Движение[СоставляющаяСписания.ИмяПредопределенныхДанных + "Регл"] = ДокументОбъект.НеразнесеннаяСумма;
				Движение.СуммаДО = ДокументОбъект.НеразнесеннаяСумма;
				Движение.СуммаРегл = ДокументОбъект.НеразнесеннаяСумма;		
			КонецЕсли;
			
			// Проводить документы в отдельной транзакции
			НачатьТранзакцию();
			ДокументОбъект.Движения.ЗадолженностьПоОбъектамВнесудебная.Записать();
			ЗафиксироватьТранзакцию();
			ДокументОбъект.Проведен = Истина;
		КонецЕсли;
		
		// Проводить документы в отдельной транзакции
		НачатьТранзакцию();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
		ЗафиксироватьТранзакцию();
		
		//ДокументОбъект.РаспределитьПоСудебнымРешениям();
		//ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	КонецЦикла;
КонецПроцедуры
